src2/test/java/org/jevis/jedatacollector/ConnectionTests/XmlTemplate.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
To change this template, choose Tools | Templates
and open the template in the editor.
-->

<SOAP-ENV:Envelope      SOAP-ENV:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">
<SOAP-ENV:Body>
<sLogRead xmlns=\"http://www.loytec.com/wsdl/XMLDL/1.0/">
    <StartDateTime type="s:dateTime" />
          <StartSeqNum type="s:unsigned" />
          <NumItems" type="s:int" />
          <s:attribute name="ReturnCompleteSet" type="s:boolean" use="optional"/>
          <s:attribute name="RequestedItems" type="s:int" use="optional"/>
          <s:attribute name="RequestedDuration" type="s:int" use="optional"/>
          <s:attribute name="RequestedAggregation" type="s0:aggregationType" use="optional" />
          <s:attribute name="AggregationIval" type="s:unsigned" use="optional" />
          <s:attribute name="HexFloat" type="boolean" use="optional" default="false" />
</sLogRead>
</SOAP-ENV:Body> 
</SOAP-ENV:Envelope>
